src/cf/InformationRegisters/ReportsSnapshots.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ReportsSnapshots</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ReportResult</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastViewedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UserSetting</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportUpdateError</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Variant</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ReportsOptions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UserSettingsHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ReportsOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ReportsOptions</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalUsers</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultVisibility</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultVisibilityOverridden</Name>
					<Comment>When True, the value of the same flag in the predefined report version is used instead of the visibility to Silence check box.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InteractiveDeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VariantKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Keywords</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Context</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilterParameterDescriptions</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FieldDescriptions</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Settings</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LongDesc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LongDescLanguage1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LongDescLanguage2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Comment>APK:1329-the table assumes few entries (in ERP ~ 1200) - optimization is not required</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Custom</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PredefinedOption</Name>
					<Comment>The configuration options</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.PredefinedExtensionsReportsOptions</v8:Type>
						<v8:Type>cfg:CatalogRef.PredefinedReportsOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AuthorOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportOptionPurposes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Location</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Subsystem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Important</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SeeAlso</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Presentations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LanguageCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LongDesc</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ReportsSnapshots/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#If Not MobileStandaloneServer Then

// The procedure saves the generated report  to the ReportsSnapshots information register as an MXL spreadsheet.
//
// Parameters:
//  ReportResult - SpreadsheetDocument - Report snapshot in MXL format.
//  ReportSettings - See ReportsOptions.DescriptionOfReport.
//
Procedure SaveUserReportSnapshot(ReportResult, ReportSettings) Export

	SetPrivilegedMode(True);
	
	RecordManager = InformationRegisters.ReportsSnapshots.CreateRecordManager();
	
	RecordManager.User = Users.CurrentUser();
	RecordManager.Report = ReportSettings.ReportRef;
	RecordManager.Variant = ReportSettings.OptionRef;
	
	RecordManager.UserSettingsHash = Common.CheckSumString(
		ReportSettings.ResultProperties.SettingsComposer.UserSettings);
	RecordManager.UserSetting = New ValueStorage(
		ReportSettings.ResultProperties.SettingsComposer.UserSettings,
		New Deflation(9));

	RecordManager.ReportResult = New ValueStorage(ReportResult, New Deflation(9));
	RecordManager.UpdateDate = CurrentSessionDate();
	RecordManager.LastViewedDate = CurrentSessionDate();
	
	RecordManager.Write();

EndProcedure

// The procedure updates user's report snapshots.
//
// Parameters:
//  FillParameters - Structure:
//   * User - CatalogRef.Users - User who owns the snapshots to be updated.
//   * ReportsSnapshots - ValueTable:
//    ** User - CatalogRef.Users
//    ** Report - CatalogRef.MetadataObjectIDs
//    ** Variant - CatalogRef.ReportsOptions
//    ** UserSettingsHash - Number
//   * CatalogNameReportOptions - String - Name of the catalog that stores report options (unless this is the ReportsOptions catalog).
//  StorageAddress - String - Used for the background execution.
//
Procedure UpdateUserReportsSnapshots(FillParameters, StorageAddress) Export

	SetPrivilegedMode(True);
	
	ModulePerformanceMonitor = Undefined;
	If Common.SubsystemExists("StandardSubsystems.PerformanceMonitor") Then
		ModulePerformanceMonitor = Common.CommonModule("PerformanceMonitor");
		MeasurementDetails = ModulePerformanceMonitor.StartTimeConsumingOperationMeasurement(
			"UpdateUserReportsSnapshots");
	EndIf;
	
	CatalogNameReportOptions = "";
	FillParameters.Property("CatalogNameReportOptions", CatalogNameReportOptions);
	
	Query = New Query;
	Query.SetParameter("User", FillParameters.User);
	If FillParameters.Property("ReportsSnapshots") Then
		Query.SetParameter("ReportsSnapshots", FillParameters.ReportsSnapshots);
		Query.Text = 
		"SELECT
		|	ReportsSnapshots.User AS User,
		|	ReportsSnapshots.Report AS RefOfReport,
		|	ReportsSnapshots.Variant AS Variant,
		|	ReportsSnapshots.UserSettingsHash AS UserSettingsHash
		|INTO SavedReportsSnapshots
		|FROM
		|	&ReportsSnapshots AS ReportsSnapshots
		|
		|INDEX BY
		|	User,
		|	Report,
		|	Variant,
		|	UserSettingsHash
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ReportsSnapshots.User AS User,
		|	ReportsSnapshots.Report AS RefOfReport,
		|	&ReportName AS ReportName,
		|	ReportsSnapshots.Variant AS Variant,
		|	ReportsSnapshots.Variant.VariantKey AS VariantKey,
		|	ReportsSnapshots.UserSettingsHash AS UserSettingsHash,
		|	ReportsSnapshots.UserSetting AS UserSetting
		|FROM
		|	InformationRegister.ReportsSnapshots AS ReportsSnapshots
		|		INNER JOIN SavedReportsSnapshots AS SavedReportsSnapshots
		|		ON ReportsSnapshots.User = SavedReportsSnapshots.User
		|			AND ReportsSnapshots.Report = SavedReportsSnapshots.RefOfReport
		|			AND ReportsSnapshots.Variant = SavedReportsSnapshots.Variant
		|			AND ReportsSnapshots.UserSettingsHash = SavedReportsSnapshots.UserSettingsHash
		|WHERE
		|	ReportsSnapshots.User = &User
		|	AND ReportsSnapshots.Variant REFS Catalog.ReportsOptions";
	Else	
		Query.Text = 
		"SELECT
		|	ReportsSnapshots.User AS User,
		|	ReportsSnapshots.Report AS RefOfReport,
		|	&ReportName AS ReportName,
		|	ReportsSnapshots.Variant AS Variant,
		|	ReportsSnapshots.Variant.VariantKey AS VariantKey,
		|	ReportsSnapshots.UserSettingsHash AS UserSettingsHash,
		|	ReportsSnapshots.UserSetting AS UserSetting
		|FROM
		|	InformationRegister.ReportsSnapshots AS ReportsSnapshots
		|WHERE
		|	ReportsSnapshots.User = &User
		|	AND ReportsSnapshots.Variant REFS Catalog.ReportsOptions";
	EndIf;
	If Not IsBlankString(CatalogNameReportOptions) Then
		Query.Text = StrReplace(Query.Text, "ReportsOptions", CatalogNameReportOptions);
	EndIf;
	
	ReportName = "CASE
	|		WHEN VALUETYPE(ReportsSnapshots.Report) = TYPE(Catalog.MetadataObjectIDs)
	|			THEN CAST(ReportsSnapshots.Report AS Catalog.MetadataObjectIDs).Name
	|		WHEN VALUETYPE(ReportsSnapshots.Report) = TYPE(Catalog.ExtensionObjectIDs)
	|			THEN CAST(ReportsSnapshots.Report AS Catalog.ExtensionObjectIDs).Name
	|		ELSE ReportsSnapshots.Report
	|	END";
	
	If Common.SubsystemExists("StandardSubsystems.AdditionalReportsAndDataProcessors") Then 
		ModuleAdditionalReportsAndDataProcessors = Common.CommonModule("AdditionalReportsAndDataProcessors");
		AdditionalReportTableName = ModuleAdditionalReportsAndDataProcessors.AdditionalReportTableName();
		
		ReportName = StringFunctionsClientServer.SubstituteParametersToString("CASE
			|		WHEN VALUETYPE(ReportsSnapshots.Report) = TYPE(Catalog.MetadataObjectIDs)
			|			THEN CAST(ReportsSnapshots.Report AS Catalog.MetadataObjectIDs).Name
			|		WHEN VALUETYPE(ReportsSnapshots.Report) = TYPE(Catalog.ExtensionObjectIDs)
			|			THEN CAST(ReportsSnapshots.Report AS Catalog.ExtensionObjectIDs).Name
			|		WHEN VALUETYPE(ReportsSnapshots.Report) = TYPE(%1)
			|			THEN CAST(ReportsSnapshots.Report AS %1).ObjectName
			|		ELSE ReportsSnapshots.Report
			|	END", AdditionalReportTableName);
	EndIf;
	
	Query.Text = StrReplace(Query.Text, "&ReportName", ReportName);
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
	
		RecordManager = InformationRegisters.ReportsSnapshots.CreateRecordManager();
		FillPropertyValues(RecordManager, Selection, "User, Variant, UserSettingsHash");
		RecordManager.Report = Selection.RefOfReport;
	
		ReportGenerationParameters = ReportsOptions.ReportGenerationParameters();
	
		ReportGenerationParameters.OptionRef1 = Selection.Variant;
		ReportGenerationParameters.RefOfReport = Selection.RefOfReport;
		ReportGenerationParameters.VariantKey = Selection.VariantKey;
		ReportGenerationParameters.DCUserSettings = Selection.UserSetting.Get();
		If Not IsBlankString(CatalogNameReportOptions) Then
			VariantKey = Selection.ReportName;
			ReportGenerationParameters.VariantKey = VariantKey;
			ReportGenerationParameters.OptionRef1 = ReportsOptions.ReportVariant(Selection.RefOfReport, VariantKey);
		EndIf;
		
		Generation1 = ReportsOptions.GenerateReport(ReportGenerationParameters, True, False);
		
		If Not Generation1.Success Then
			WriteLogEvent(NStr("en = 'Update report snapshots';", Common.DefaultLanguageCode()),
			EventLogLevel.Error,
			Common.MetadataObjectByID(Selection.RefOfReport),
			Selection.Variant,
			Generation1.ErrorText);
		EndIf;
		
		RecordManager.ReportResult = New ValueStorage(Generation1.SpreadsheetDocument, New Deflation(9));
		RecordManager.UserSetting = Selection.UserSetting;
		RecordManager.UpdateDate = CurrentSessionDate();
		RecordManager.LastViewedDate = CurrentSessionDate();
		RecordManager.ReportUpdateError = Not Generation1.Success;
		RecordManager.Write();
	
	EndDo;
	
	If ModulePerformanceMonitor <> Undefined Then
		ModulePerformanceMonitor.EndTimeConsumingOperationMeasurement(MeasurementDetails, Selection.Count());
	EndIf;

EndProcedure

#EndIf

// The function returns the list of user's report snapshots.
//
// Parameters:
//  User - CatalogRef.Users - User who owns the snapshot list to be generated.
//  CatalogNameReportOptions - String - Name of the catalog that stores report options (unless this is the ReportsOptions catalog).
// Returns:
//  ValueTable:
//   * User - CatalogRef.Users - User who owns the report snapshot.
//   * Report - CatalogRef.MetadataObjectIDs - Report ID.
//   * Variant - DefinedType.OptionOfReportToUpdate - Report option.
//   * OptionDescription - String - Report option description (applies to the standalone mode).
//   * UserSettingsHash - Number  - User setting hash.
//
Function UserReportsSnapshots(User, CatalogNameReportOptions) Export

	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.SetParameter("User", User);
	Query.Text =
	"SELECT
	|	ReportsSnapshots.User AS User,
	|	ReportsSnapshots.Report AS RefOfReport,
	|	ReportsSnapshots.Variant AS Variant,
	|	ReportsSnapshots.Variant.Description AS OptionDescription,
	|	ReportsSnapshots.UserSettingsHash AS UserSettingsHash,
	|	ReportsSnapshots.UpdateDate AS UpdateDate
	|FROM
	|	InformationRegister.ReportsSnapshots AS ReportsSnapshots
	|WHERE
	|	ReportsSnapshots.User = &User
	|	AND ReportsSnapshots.Variant REFS Catalog.ReportsOptions
	|	AND NOT ReportsSnapshots.Variant.Description IS NULL
	|
	|ORDER BY
	|	Report,
	|	Variant,
	|	UserSettingsHash";
	If User = Undefined Then
		Query.Text = StrReplace(Query.Text, "ReportsSnapshots.User = &User", "TRUE");
	EndIf;
	If Not IsBlankString(CatalogNameReportOptions) Then
		Query.Text = StrReplace(Query.Text, "ReportsOptions", CatalogNameReportOptions);
	EndIf;
	
	UserReportsSnapshots = Query.Execute().Unload();
	UserReportsSnapshots.Columns.RefOfReport.Name = "Report";

	Return UserReportsSnapshots;

EndFunction

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.AccessManagement

// Parameters:
//   Restriction - See AccessManagementOverridable.OnFillAccessRestriction.Restriction.
//
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	IsAuthorizedUser(User)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#EndIf
